Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size[quarkus.blaze-persistence.default-batch-size]` [.description] -- An integer value that defines the default batch size for entity view attributes. By default the value is 1 and can be overridden either via `com.blazebit.persistence.view.BatchFetch#size()` or by setting this property via `com.blazebit.persistence.view.EntityViewSetting#setProperty`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size[quarkus.blaze-persistence.default-batch-size]` [.description] -- エンティティービューの属性のデフォルトバッチサイズを定義する整数値です。デフォルトでは、この値は 1 であり、 `com.blazebit.persistence.view.BatchFetch#size()` で上書きするか、 `com.blazebit.persistence.view.EntityViewSetting#setProperty` にこのプロパティーを設定することができます。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size[quarkus.blaze-persistence.default-batch-size]` [.description] -- An integer value that defines the default batch size for entity view attributes. By default, the value is 1 and can be overridden either via `com.blazebit.persistence.view.BatchFetch#size()` or by setting this property via `com.blazebit.persistence.view.EntityViewSetting#setProperty`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.default-batch-size[quarkus.blaze-persistence.default-batch-size]` [.description] -- エンティティービューの属性のデフォルトバッチサイズを定義する整数値です。デフォルトでは、この値は 1 であり、 `com.blazebit.persistence.view.BatchFetch#size()` で上書きするか、 `com.blazebit.persistence.view.EntityViewSetting#setProperty` にこのプロパティーを設定することができます。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode[quarkus.blaze-persistence.expect-batch-mode]` [.description] -- A mode specifying if correlation value, view root or embedded view batching is expected. By default the value is `values` and can be overridden by setting this property via `com.blazebit.persistence.view.EntityViewSetting#setProperty`. Valid values are - `values` - `view_roots` - `embedding_views` --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode[quarkus.blaze-persistence.expect-batch-mode]` [.description] -- 相関値、ビュー ルート、または埋め込みビューのバッチが予期されるかどうかを指定するモード。 デフォルトでは、値は `values` ですが、 `com.blazebit.persistence.view.EntityViewSetting#setProperty` を介してこのプロパティを設定することでオーバーライドできます。 有効な値は以下の通りです - `values` - `view_roots` - `embedding_views` --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode[quarkus.blaze-persistence.expect-batch-mode]` [.description] -- A mode specifying if correlation value, view root or embedded view batching is expected. By default, the value is `values` and can be overridden by setting this property via `com.blazebit.persistence.view.EntityViewSetting#setProperty`. Valid values are - `values` - `view_roots` - `embedding_views` --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expect-batch-mode[quarkus.blaze-persistence.expect-batch-mode]` [.description] -- 相関値、ビュールート、埋め込みビューのバッチングが期待されるかを指定するモードです。デフォルトでは `values` が指定されていますが、 `com.blazebit.persistence.view.EntityViewSetting#setProperty` でこのプロパティーを設定することでオーバーライドできます。有効な値は以下の通りです。 - `values` - `view_roots` - `embedding_views` --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expression-cache-class]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expression-cache-class[quarkus.blaze-persistence.expression-cache-class]` [.description] -- The full qualified expression cache implementation class name. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.expression-cache-class]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.expression-cache-class[quarkus.blaze-persistence.expression-cache-class]` [.description] — 完全修飾式キャッシュ実装クラス名 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] -- If set to true, the CTE queries are inlined by default. Valid values for this property are `true`, `false` or `auto`. Default is `true` which will always inline non-recursive CTEs. The `auto` configuration will only make use of inlining if the JPA provider and DBMS dialect support/require it. The property can be changed for a criteria builder before constructing a query. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] — true に設定すると、CTE クエリーがデフォルトでインライン化されます。このプロパティーに使用できる値は、 `true`、 `false`、または `auto` です。デフォルトの値は、 `true` で、非再帰 CTE を常にインライン化します。 `auto` 設定は、JPA プロバイダーと DBMS ダイアレクトが対応または必要とする場合にのみインライン化を使用できます。このプロパティーは、クエリーを構成する前にクライテリアビルダー (criteria builder) に対して変更できます。 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] -- If set to true, the CTE queries are inlined by default. Valid values for this property are `true`, `false` or `auto`. Default is `true` which will always inline non-recursive CTEs. The `auto` configuration will only make use of inlining if the Jakarta Persistence provider and DBMS dialect support/require it. The property can be changed for a criteria builder before constructing a query. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] -- trueに設定すると、CTEクエリーはデフォルトでインライン化されます。このプロパティに有効な値は `true`、 `false` または `auto` です。デフォルトは `true` で、非再帰的なCTEを常にインライン化します。auto` 設定は、Jakarta PersistenceプロバイダとDBMS方言がサポート/要求する場合にのみ、インライン化を使用します。このプロパティは、クエリを構築する前に、クライテリアビルダのために変更することができます。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading[quarkus.blaze-persistence.template-eager-loading]` [.description] -- A boolean flag to make it possible to prepare all view template caches on startup. By default the eager loading of the view templates is disabled to have a better startup performance. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading[quarkus.blaze-persistence.template-eager-loading]` [.description] -- 起動時にすべてのビューテンプレートキャッシュを準備することを可能にするブール値フラグ。デフォルトでは、起動時のパフォーマンスを向上させるためにビューテンプレートのイーガーローディングは無効になっています。このプロパティーに有効な値は `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading[quarkus.blaze-persistence.template-eager-loading]` [.description] -- A boolean flag to make it possible to prepare all view template caches on startup. By default, the eager loading of the view templates is disabled to have a better startup performance. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.template-eager-loading[quarkus.blaze-persistence.template-eager-loading]` [.description] -- 起動時にすべてのビューテンプレートキャッシュを準備することを可能にするブール値フラグ。デフォルトでは、起動時のパフォーマンスを向上させるためにビューテンプレートのイーガーローディングは無効になっています。このプロパティーに有効な値は `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview[quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]` [.description] -- A boolean flag to make it possible to disable the strict validation that disallows the use of an updatable entity view type for owned relationships. By default the use is disallowed i.e. the default value is `true`, but since there might be strange models out there, it possible to allow this. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview[quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]` [.description] — 所有されている関係の更新可能なエンティティー表示タイプを使用できないようにする厳格な検証を無効にできるブール値のフラグ。デフォルトでは、できないように設定されています (`true`)。ただし、特殊な例も考えられるので、許可することも可能です。利用できるプロパティーの値は、 `true` または `false` です。 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview[quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]` [.description] -- A boolean flag to make it possible to disable the strict validation that disallows the use of an updatable entity view type for owned relationships. By default, the use is disallowed i.e. the default value is `true`, but since there might be strange models out there, it is possible to allow this. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.disallow-owned-updatable-subview[quarkus.blaze-persistence.updater.disallow-owned-updatable-subview]` [.description] -- 所有されている関係の更新可能なエンティティー表示タイプを使用できないようにする厳格な検証を無効にできるブール値のフラグ。デフォルトでは、できないように設定されています (`true`)。ただし、特殊な例も考えられるので、許可することも可能です。利用できるプロパティーの値は、 `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading[quarkus.blaze-persistence.updater.eager-loading]` [.description] -- A boolean flag to make it possible to prepare the entity view updater cache on startup. By default the eager loading of entity view updates is disabled to have a better startup performance. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading[quarkus.blaze-persistence.updater.eager-loading]` [.description] — エンティティー表示アップデーターキャッシュをスタートアップで準備することを可能にするブールフラグ。デフォルトでは、スタートアップパフォーマンスを向上するために、エンティティー表示更新の一括読み込みが無効化されています。このプロパティーに使用できる値は、 `true` または `false` です。 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading[quarkus.blaze-persistence.updater.eager-loading]` [.description] -- A boolean flag to make it possible to prepare the entity view updater cache on startup. By default, the eager loading of entity view updates is disabled to have a better startup performance. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.eager-loading[quarkus.blaze-persistence.updater.eager-loading]` [.description] -- エンティティー表示アップデーターキャッシュをスタートアップで準備することを可能にするブールフラグ。デフォルトでは、スタートアップパフォーマンスを向上するために、エンティティー表示更新の一括読み込みが無効化されています。このプロパティーに使用できる値は、 `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter[quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]` [.description] -- A boolean flag that allows to switch from warnings to boot time validation errors when invalid plural attribute setters are encountered while the strict cascading check is enabled. When `true`, a boot time validation error is thrown when encountering an invalid setter, otherwise just a warning. This configuration has no effect when the strict cascading check is disabled. By default the use is disabled i.e. the default value is `false`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter[quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]` [.description] -- 厳密なカスケードチェックが有効なときに、無効な複数の属性セッターに遭遇したときに、警告からブートタイム検証エラーに切り替えることができるブール値フラグです。 `true` の場合は、無効なセッターに遭遇したときにブートタイム検証エラーが出力され、それ以外の場合は警告のみとなります。この設定は、厳密なカスケードチェックが無効になっている場合には、何の効果もありません。デフォルトでは、使用は無効になっています。つまり、デフォルト値は `false` になっています。このプロパティーに有効な値は `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter[quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]` [.description] -- A boolean flag that allows to switch from warnings to boot time validation errors when invalid plural attribute setters are encountered while the strict cascading check is enabled. When `true`, a boot time validation error is thrown when encountering an invalid setter, otherwise just a warning. This configuration has no effect when the strict cascading check is disabled. By default, the use is disabled i.e. the default value is `false`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.error-on-invalid-plural-setter[quarkus.blaze-persistence.updater.error-on-invalid-plural-setter]` [.description] -- 厳密なカスケードチェックが有効なときに、無効な複数の属性セッターに遭遇したときに、警告からブートタイム検証エラーに切り替えることができるブール値フラグです。 `true` の場合は、無効なセッターに遭遇したときにブートタイム検証エラーが出力され、それ以外の場合は警告のみとなります。この設定は、厳密なカスケードチェックが無効になっている場合には、何の効果もありません。デフォルトでは、使用は無効になっています。つまり、デフォルト値は `false` になっています。このプロパティーに有効な値は `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] -- A boolean flag to make it possible to disable the strict cascading check that disallows setting updatable or creatable entity views on non-cascading attributes before being associated with a cascading attribute. When disabled, it is possible, like in JPA, that the changes done to an updatable entity view are not flushed when it is not associated with an attribute that cascades updates. By default the use is enabled i.e. the default value is `true`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] — カスケード属性に関連する前に、非カスケード属性での設定の更新可能または作成可能なエンティティー表示を許可しない厳格なカスケードチェックを無効化できるブールフラグ。無効化すると、JPA のように、更新をカスケーディング属性に関連していない場合、更新可能なエンティティー表示への変更がフラッシュされません。デフォルトは有効化されています (`true`)。このプロパティーに使用できる値は、 `true` または `false` です。 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] -- A boolean flag to make it possible to disable the strict cascading check that disallows setting updatable or creatable entity views on non-cascading attributes before being associated with a cascading attribute. When disabled, it is possible, like in JPA, that the changes done to an updatable entity view are not flushed when it is not associated with an attribute that cascades updates. By default, the use is enabled i.e. the default value is `true`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] -- カスケード属性に関連する前に、非カスケード属性での設定の更新可能または作成可能なエンティティー表示を許可しない厳格なカスケードチェックを無効化できるブールフラグ。無効化すると、JPA のように、更新をカスケーディング属性に関連していない場合、更新可能なエンティティー表示への変更がフラッシュされません。デフォルトは有効化されています (`true`)。このプロパティーに使用できる値は、 `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] -- A boolean flag to make it possible to disable the strict cascading check that disallows setting updatable or creatable entity views on non-cascading attributes before being associated with a cascading attribute. When disabled, it is possible, like in Jakarta Persistence, that the changes done to an updatable entity view are not flushed when it is not associated with an attribute that cascades updates. By default, the use is enabled i.e. the default value is `true`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.updater.strict-cascading-check[quarkus.blaze-persistence.updater.strict-cascading-check]` [.description] -- 更新可能または作成可能なエンティティ・ビューをカスケード属性に関連付ける前に、カスケード属性以外の属性に設定することを禁止する厳密なカスケード・チェックを無効にするためのブール値フラグです。無効にすると、Jakarta Persistenceのように、更新可能なエンティティ・ビューが更新をカスケードする属性と関連付けられていない場合に、そのビューに加えられた変更がフラッシュされない可能性があります。デフォルトでは、このプロパティは有効であり、デフォルト値は `true` です。このプロパティの有効な値は `true` または `false` です。 --

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled[quarkus.kogito.devservices.enabled]` [.description] -- If DevServices has been explicitly enabled or disabled. DevServices is generally enabled by default, unless there is an existing configuration present. When DevServices is enabled Quarkus will attempt to automatically configure and start a Data Index when running in Dev mode. --
ja_jp: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.enabled[quarkus.kogito.devservices.enabled]` [.description] -- DevServices が明示的に有効または無効化されている場合。DevServices は通常、既存の設定がない限り、デフォルトで有効になっています。DevServices が有効な場合、Quarkusは Devモード で実行しているときに、自動的にデータインデックスを構成して開始しようとします。 --

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name[quarkus.kogito.devservices.image-name]` [.description] -- The container image name to use. --
ja_jp: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.image-name[quarkus.kogito.devservices.image-name]` [.description] 使用するコンテナイメージの名前です。

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port[quarkus.kogito.devservices.port]` [.description] -- Optional fixed port the dev service will listen to. If not defined, the port will be chosen randomly. --
ja_jp: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.port[quarkus.kogito.devservices.port]` [.description] Dev Services がリッスンする固定ポートを指定します。 定義されていない場合、ポートはランダムに選択されます。

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name[quarkus.kogito.devservices.service-name]` [.description] -- The value of the `kogito-dev-service-data-index` label attached to the started container. This property is used when shared is set to true. In this case, before starting a container, Dev Services for Kogito looks for a container with the `kogito-dev-service-data-index` label set to the configured value. If found, it will use this container instead of starting a new one. Otherwise it starts a new container with the `kogito-dev-service-data-index` label set to the specified value. This property is used when you need multiple shared Data Index instances. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name[quarkus.kogito.devservices.service-name]` [.description] 起動したコンテナに設定されている `kogito-dev-service-data-index` ラベルの値。このプロパティはsharedプロパティがtrueに設定されているときに使用されます。この場合、コンテナを起動する前に、Dev Services for Kogito は `kogito-dev-service-data-index` ラベルに設定された値を持つコンテナを探します。見つかった場合は、新しいコンテナを起動する代わりに、このコンテナを使用します。そうでない場合は、 `kogito-dev-service-data-index` ラベルに設定された値を持つ新しいコンテナを開始します。このプロパティは、複数の共有データインデックスインスタンスが必要な場合に使用します。
